# Спортсмен занимается ежедневными пробежками.
# В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который результат спортсмена составит не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.
# Например: a = 2, b = 3.
# Результат:
# 1-й день: 2
# 2-й день: 2,2
# 3-й день: 2,42
# 4-й день: 2,66
# 5-й день: 2,93
# 6-й день: 3,22
#
# Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.



start = int(input("КМ в первый день:\n--> "))
goal = int(input("Желаемый результат:\n--> "))
days = 1
distance = start

while distance // goal < 1:
    distance = distance + ((distance / 100) * 10)
    days = days + 1

# print(str(days) + "-й день: " + str(distance))
print(days)
